trial_case/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1.5;

boundaryField
{
    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"

    top
    {
        type            symmetryPlane;
    }
    ground
    {
        type            symmetryPlane;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 1.5;
    }
    outlet
    {
        type            zeroGradient;
    }
    side
    {
        type            symmetryPlane;
    }
    side2
    {
        type            symmetryPlane;
    }
    airfoil
    {
        type            kqRWallFunction;
        value           uniform 1.5;
    }
}


// ************************************************************************* //
